<template>
  <div class="twitter-container">
    <v-layout row wrap class="disease-container mt-4">
      <v-flex lg6 md6 class="pie-container">
        <div class="out_graph">
          <div class="in_graph">
            <h1 id="text" class="font-weight-thin">우울증</h1>
            <canvas id="pie-chart" class="pie-chart"></canvas>
          </div>
        </div>
      </v-flex>
      <v-flex lg4 md4>
            <vue-word-cloud
          :words="[['있다', 7758], ['들', 5201], ['되다', 5169], ['것', 5122], ['적', 4001], ['수', 2638], ['이', 2334], ['않다', 2187], ['사람', 2064], ['없다', 1946], ['같다', 1850], ['그', 1820], ['이다', 1735], ['보다', 1678], ['일', 1667], ['때', 1629], ['받다', 1624], ['분', 1592], ['생각', 1529], ['말', 1378], ['아니다', 1377], ['못', 1350], ['좋다', 1312], ['치료', 1279], ['등', 1233], ['제', 1230], ['안', 1162], ['많다', 1127], ['들다', 1126], ['저', 1125], ['시간', 1116], ['가다', 1086], ['경우', 1048], ['자다', 1029], ['그렇다', 1017], ['먹다', 972], ['더', 958], ['자신', 943], ['내', 894], ['어떻다', 873], ['다른', 867], ['때문', 852], ['년', 811], ['중', 800], ['약', 782], ['사회', 767], ['아이', 756], ['많이', 755], ['정도', 750], ['문제', 736], ['월', 686], ['행동', 669], ['자', 666], ['집중', 664], ['위', 645], ['나', 637], ['우리', 631], ['전', 630], ['책', 623], ['나오다', 622], ['가지', 601], ['되어다', 600], ['시키다', 588], ['마음', 580], ['싶다', 580], ['모임', 578], ['력', 570], ['대한', 552], ['병원', 552], ['뇌', 544], ['성', 542], ['그리고', 538], ['의', 535], ['만들다', 532], ['회원', 527], ['방법', 525], ['이렇다', 519], ['알다', 516], ['효과', 511], ['다', 509], ['학교', 509], ['고', 504], ['너무', 503], ['지금', 482], ['주다', 477], ['자기', 476], ['하지만', 475], ['명', 472], ['읽다', 472], ['훈련', 467], ['우울증', 456], ['원', 455], ['글', 451], ['보이다', 450], ['상담', 449], ['도움', 447], ['증상', 444], ['한', 443], ['성인', 441]]"
          :color="([, weight]) => weight > 10000 ? '#ffd077' : weight > 5000 ? '#3bc4c7' : weight > 3000 ? '#3a9eea' : weight > 1500 ? '#ff4e69' :  weight > 1000 ? '#461e47' : weight > 500 ? 'primary' : 'secondary'"
          font-family="Roboto"
          />
      </v-flex>
    </v-layout>
    <v-layout row wrap class="disease-container mt-4">
      <v-flex lg6 md6 class="pie-container">
        <div class="out_graph">
          <div class="in_graph">
            <h1 id="text" class="font-weight-thin">ADHD</h1>
            <canvas id="pie-chart2" class="pie-chart"></canvas>
          </div>
        </div>
      </v-flex>
      <v-flex lg4 md4>
            <vue-word-cloud
          :words="[['있다', 7758], ['들', 5201], ['되다', 5169], ['것', 5122], ['적', 4001], ['수', 2638], ['이', 2334], ['않다', 2187], ['사람', 2064], ['없다', 1946], ['같다', 1850], ['그', 1820], ['이다', 1735], ['보다', 1678], ['일', 1667], ['때', 1629], ['받다', 1624], ['분', 1592], ['생각', 1529], ['말', 1378], ['아니다', 1377], ['못', 1350], ['좋다', 1312], ['치료', 1279], ['등', 1233], ['제', 1230], ['안', 1162], ['많다', 1127], ['들다', 1126], ['저', 1125], ['시간', 1116], ['가다', 1086], ['경우', 1048], ['자다', 1029], ['그렇다', 1017], ['먹다', 972], ['더', 958], ['자신', 943], ['내', 894], ['어떻다', 873], ['다른', 867], ['때문', 852], ['년', 811], ['중', 800], ['약', 782], ['사회', 767], ['아이', 756], ['많이', 755], ['정도', 750], ['문제', 736], ['월', 686], ['행동', 669], ['자', 666], ['집중', 664], ['위', 645], ['나', 637], ['우리', 631], ['전', 630], ['책', 623], ['나오다', 622], ['가지', 601], ['되어다', 600], ['시키다', 588], ['마음', 580], ['싶다', 580], ['모임', 578], ['력', 570], ['대한', 552], ['병원', 552], ['뇌', 544], ['성', 542], ['그리고', 538], ['의', 535], ['만들다', 532], ['회원', 527], ['방법', 525], ['이렇다', 519], ['알다', 516], ['효과', 511], ['다', 509], ['학교', 509], ['고', 504], ['너무', 503], ['지금', 482], ['주다', 477], ['자기', 476], ['하지만', 475], ['명', 472], ['읽다', 472], ['훈련', 467], ['우울증', 456], ['원', 455], ['글', 451], ['보이다', 450], ['상담', 449], ['도움', 447], ['증상', 444], ['한', 443], ['성인', 441]]"
          :color="([, weight]) => weight > 10000 ? '#ffd077' : weight > 5000 ? '#3bc4c7' : weight > 3000 ? '#3a9eea' : weight > 1500 ? '#ff4e69' :  weight > 1000 ? '#461e47' : weight > 500 ? 'primary' : 'secondary'"
          font-family="Roboto"
          />
      </v-flex>
    </v-layout>
    <v-layout row wrap class="disease-container mt-4">
      <v-flex lg6 md6 class="pie-container">
        <div class="out_graph">
          <div class="in_graph">
            <h1 id="text" class="font-weight-thin">정신분열증</h1>
            <canvas id="pie-chart3" class="pie-chart"></canvas>
          </div>
        </div>
      </v-flex>
      <v-flex lg4 md4>
            <vue-word-cloud
          :words="[['있다', 7758], ['들', 5201], ['되다', 5169], ['것', 5122], ['적', 4001], ['수', 2638], ['이', 2334], ['않다', 2187], ['사람', 2064], ['없다', 1946], ['같다', 1850], ['그', 1820], ['이다', 1735], ['보다', 1678], ['일', 1667], ['때', 1629], ['받다', 1624], ['분', 1592], ['생각', 1529], ['말', 1378], ['아니다', 1377], ['못', 1350], ['좋다', 1312], ['치료', 1279], ['등', 1233], ['제', 1230], ['안', 1162], ['많다', 1127], ['들다', 1126], ['저', 1125], ['시간', 1116], ['가다', 1086], ['경우', 1048], ['자다', 1029], ['그렇다', 1017], ['먹다', 972], ['더', 958], ['자신', 943], ['내', 894], ['어떻다', 873], ['다른', 867], ['때문', 852], ['년', 811], ['중', 800], ['약', 782], ['사회', 767], ['아이', 756], ['많이', 755], ['정도', 750], ['문제', 736], ['월', 686], ['행동', 669], ['자', 666], ['집중', 664], ['위', 645], ['나', 637], ['우리', 631], ['전', 630], ['책', 623], ['나오다', 622], ['가지', 601], ['되어다', 600], ['시키다', 588], ['마음', 580], ['싶다', 580], ['모임', 578], ['력', 570], ['대한', 552], ['병원', 552], ['뇌', 544], ['성', 542], ['그리고', 538], ['의', 535], ['만들다', 532], ['회원', 527], ['방법', 525], ['이렇다', 519], ['알다', 516], ['효과', 511], ['다', 509], ['학교', 509], ['고', 504], ['너무', 503], ['지금', 482], ['주다', 477], ['자기', 476], ['하지만', 475], ['명', 472], ['읽다', 472], ['훈련', 467], ['우울증', 456], ['원', 455], ['글', 451], ['보이다', 450], ['상담', 449], ['도움', 447], ['증상', 444], ['한', 443], ['성인', 441]]"
          :color="([, weight]) => weight > 10000 ? '#ffd077' : weight > 5000 ? '#3bc4c7' : weight > 3000 ? '#3a9eea' : weight > 1500 ? '#ff4e69' :  weight > 1000 ? '#461e47' : weight > 500 ? 'primary' : 'secondary'"
          font-family="Roboto"
          />
      </v-flex>
    </v-layout>
  </div>
</template>

<script>
import Chart from 'chart.js'
import $ from 'jquery'

export default {
  name: 'Graph',
  data () {
    return {
      ajouData: {
        type: 'pie',
          data: {
            labels: ["우울증 O", "우울증 X"],
            datasets: [{
              backgroundColor: [
                "#3498db",
                "#95a5a6",
              ],
              data: [78, 22]
            }]
          },
        options:{}
      }
    }
  },
  methods: {
    createChart (chartId, chartData) {
      const ctx = document.getElementById(chartId)
      const chart = this.myChart = new Chart(ctx, {
        type: chartData.type,
        data: chartData.data,
        options: chartData.options
      })
    }
  },
  mounted() {
    this.createChart('pie-chart', this.ajouData)
    this.createChart('pie-chart2', this.ajouData)
    this.createChart('pie-chart3', this.ajouData)
  },

}
</script>
<style>
  .disease-container{
    height: 500px !important;    
  }
  .pie-container{
    margin-top: 65px;
  }
  .twitter-container{
    margin-top: 70px;
  }
  div.out_graph{
    text-align: center;
  }

  div.in_graph{
    display: inline-block;
  }
  .pie-chart{
    height: 100% !important;
    width: 100% !important;
  }
  div.out_boardwrite{
    text-align: center;
  }

  div.in_boardwrite{
    display: inline-block;
  }

  #card_boardwrite{
    margin-top: 160px;
    width: 800px;
  }
  .wordcloud_layout{
    text-align: center;
    height: 100%;
  }
  .wordcloud_name{
    font-size: 50px;
    color: white;
  }
</style>
